@extends('layouts.app')
@section('title','Index')
@section('content')
    <div class="container">
        <div class="row">
            <div class="col-lg-12">
                <div class="page-content">

                    <!-- ***** Featured Start ***** -->
                    <div class="row">
                        <div class="col-lg-12">
                            <div class="feature-banner header-text">
                                <div class="row">
                                    <div class="col-lg-4">
                                        <img src="{{asset('images/logo.png')}}" alt="" style="border-radius: 23px;">
                                    </div>
                                    <div class="col-lg-8">
                                        <div class="text-white">
                                           Furia Academy - Бұл Тегін Бағдарламалау тілдеріне арналған курс.Бейнаматериалдар және Тапсырмалар болады.Қосымша бізде Кітаптар сыйлыққа беріледі<br><br>
                                            <hr>

                                            Курстың мақсаттары:

                                            Бағдарламалаудың негізгі принциптері: студенттер бағдарламалаудың негізгі тұжырымдамалары мен принциптерін, соның ішінде айнымалыларды, шартты операторларды, циклдар мен функцияларды меңгереді. Олар әртүрлі бағдарламалау тілдерімен танысады және әрі қарай оқу үшін біреуін таңдайды. <br><br>
                                            Таңдалған бағдарламалау тілін терең түсіну: студенттер таңдалған бағдарламалау тілінде оның синтаксисін, деректер құрылымын, алгоритмдерін және объектіге бағытталған бағдарламалау принциптерін үйрену арқылы білімдерін тереңдетеді. Олар өз дағдыларын бекіту үшін шағын жобалар мен қолданбаларды әзірлеу мүмкіндігіне ие болады. <br><br>

                                            Бағдарламалық жасақтама жобаларын әзірлеу: студенттер қарапайым жобалардан бастап, біртіндеп күрделіге ауыса отырып, нақты жобалармен жұмыс істейді. Олар бағдарламалық жасақтаманы әзірлеу процесі туралы, соның ішінде талаптарды талдау, жобалау, әзірлеу, тестілеу және енгізу туралы біледі. Әрбір жоба шығармашылықты және нақты мәселелерді шешуді ынталандырады. <br><br>

                                            Дағдыларды практикалық қолдану: студенттер өздерінің бағдарламалау дағдыларын веб-қосымшаларды, Мобильді қосымшаларды, ойындарды және басқа бағдарламалық шешімдерді әзірлеу сияқты нақты сценарийлерде қолданады. Олар заманауи және инновациялық қосымшаларды құру үшін заманауи құралдармен және құрылымдармен жұмыс істейді.<br><br>

                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>

@endsection
